{
  "personal": {
    "name": "Duong Nguyen",
    "title": "Tech Business Analyst",
    "tagline": "Bridging business needs with technical solutions through analysis and design",
    "bio": "Recent Information Systems graduate with hands-on experience as a Business Analyst Trainee and ERP Implementation Intern. I specialize in requirements engineering, process modeling, and ERP system implementation (FAST, Odoo). My specialties include a proactive spirit and eagerness to learn, driving me to continuously improve and adapt in dynamic environments. My objective is to work in a professional setting where I can develop my expertise in the software industry and contribute to innovative business solutions.",
    "avatar": "/assets/avatar w design.png",
    "location": "Ho Chi Minh City, Vietnam",
    "email": "duongnd3326@gmail.com",
    "phone": "(84) 938057849",
    "website": "https://www.duongnguyen.webpage.social",
    "resume": "/assets/duong-nguyen-resume.pdf",
    "availability": "Available for full-time opportunities"
  },
  "social": {
    "github": "https://github.com/douboNg",
    "linkedin": "https://linkedin.com/in/duongnd33/",
    "twitter": "https://twitter.com/",
    "email": "mailto:duongnd3326@gmail.com"
  },
  "journey": {
    "introduction": "My journey in business analysis began during my Information Systems studies and has evolved into a passion for bridging business needs with technical solutions. From learning requirements engineering to implementing ERP systems, every step has been driven by the desire to solve complex business problems and create value through technology.",
    "philosophy": "I believe that great business solutions are not just about technical implementation—they're about understanding stakeholders, analyzing processes, and creating systems that truly serve business objectives. Every project is an opportunity to learn something new and make a meaningful impact on organizational efficiency.",
    "currentFocus": [
      "Mastering requirements engineering and documentation best practices",
      "Developing expertise in ERP system implementation and customization",
      "Building skills in process modeling and business process improvement",
      "Contributing to digital transformation initiatives in various domains"
    ],
    "goals": [
      "Lead business analysis teams in delivering successful digital transformation projects",
      "Become a subject matter expert in ERP systems and enterprise software solutions",
      "Establish myself as a trusted advisor for business process optimization",
      "Contribute to the development of innovative business analysis methodologies"
    ]
  },
  "testimonials": [
    {
      "id": 1,
      "name": "Project Manager",
      "role": "Senior Project Manager at KYANON DIGITAL",
      "company": "KYANON DIGITAL",
      "text": "Duong demonstrated exceptional analytical skills during his trainee period. His ability to document complex requirements and manage change requests for our eCommerce projects was impressive. He consistently delivered detailed user guides and requirement matrices that greatly helped our development teams.",
      "image": "/assets/testimonials/kyanon-manager.jpg"
    },
    {
      "id": 2,
      "name": "Implementation Lead",
      "role": "ERP Implementation Lead at FAST",
      "company": "FAST", 
      "text": "During his internship, Duong showed great potential in ERP implementation. He quickly grasped HR module complexities and created clear BPMN diagrams that helped our development team understand client requirements. His attention to detail and process mapping skills are noteworthy.",
      "image": "/assets/testimonials/fast-lead.jpg"
    },
    {
      "id": 3,
      "name": "Academic Supervisor",
      "role": "Professor at University of Information Technology",
      "company": "UIT - VNU HCMC",
      "text": "Duong consistently excelled in systems analysis projects. His comprehensive SRS documentation for the music streaming website project was exemplary, demonstrating strong requirements gathering and technical documentation skills. He has great potential in the business analysis field.",
      "image": "/assets/testimonials/professor.jpg"
    }
  ]
}